let questions = [{
        "question": "你最喜歡以下哪種類型的音樂？",
        "answers": [
            ["搖滾音樂", 2],
            ["抒情音樂", 3],
            ["民謠音樂", 4]
        ]
    },
    {
        "question": "你手機裡有幾個音樂APP？",
        "answers": [
            ["一個", 4],
            ["兩個", 3],
            ["三個以上", 5]
        ]
    },
    {
        "question": "更看重歌詞還是旋律?",
        "answers": [
            ["歌詞", 4],
            ["旋律", 5],
            //["還好", 6]
        ]
    },
    {
        "question": "有喜歡了三年以上的歌手嗎，並且時常會聽他的歌？",
        "answers": [
            ["有", 6],
            ["沒有", 5],
            //["不要", 7]
        ]
    },
    {
        "question": "以下音樂你比較常聽？",
        "answers": [
            ["歐美音樂", 6],
            ["港台音樂", 7],
            ["內地音樂", 8],
            ["沒特別哪一類，好聽就可以", 9]
        ]
    },
    {
        "question": "你會分享什麼樣的歌給朋友？",
        "answers": [
            ["能代表自己心情的", 8],
            ["覺得好聽而想推薦的", 7],
            //["秋高氣爽", "A"]
        ]
    },
    {
        "question": "你很喜歡一首歌的時候你會？",
        "answers": [
            ["單曲循環直到自己學會", 10],
            ["會經常聽，但不會到單曲循環的地步", 8],
            //["不知道", 10]
        ]
    },
    {
        "question": "如果有機會能成為一名歌手，你會想走哪種路線？",
        "answers": [
            ["跟朋友組樂團", 10],
            ["偶像派歌手", 9],
            ["詞曲創作實力派", 10]
        ]
    },
    {
        "question": "會聽歌聽到流淚？",
        "answers": [
            ["會", "C"],
            ["不會", "A"]
        ]
    },
    {
        "question": "曾經有單曲循環3天嗎？",
        "answers": [
            ["有", "D"],
            ["沒有", "B"]
        ]
    }

];

let finalAnswers = {
    "A": ["你的性格弱點是懶惰", "你是一個怕麻煩的人，生性懶惰，除非跟朋友約好或是有事非得出門，不然你寧願也非常好，與其說你不喜歡計較，不如說是懶得計較。"],
    "B": ["你的性格弱點是優柔寡斷", "選擇、做決定對你來說是難上加難，從生活上的小事想要吃什麼餐點，到感情糾葛，這個弱點一直跟著你讓你無法果斷放生，你心裡知道說清楚才是最好的解決辦法，但不想傷害人的初心卻讓你優柔寡斷，用拖延和轉移話題來面對，且你又容易在意他人的看法，偶爾做決定時也會隨波逐流，沒有遵從自己內心的聲音。"],
    "C": ["你的性格弱點是情緒化", "你是個愛逞強的人，你不願將脆弱的一面輕易展現，寧願自己療傷也不想讓別人知道你的弱點，雖然在人前你因為內心細膩的特質顯得善解人意，讓大家都以為你友善又溫柔，但其實你經常因為一點小事或一句話胡思亂想，滿腦小劇場，甚至讓你深夜暗自流淚或失眠。"],
    "D": ["你的性格弱點是固執", "你擁有一顆堅定的心，認定的事情就不會輕易改變，對於感情也是如此，專一的你會是很好的情人。但過於固執也是缺點， 有時會難以溝通， 無法接受其他人的意見和價值觀， 顯得不懂變通、 不夠圓融。 "]
};